Repository: Daniel-KM/Omeka-S-module-IiifSearch
Catalog: language/*.po
Languages: fr

source: Missing or empty query.
fr: Requête vide ou manquante.

source: Search is not supported for resource #%d (missing XML and/or image files).
fr: La recherche n’est pas gérée pour la ressource #%d (pas de fichier xml ou pas de fichier image).

source: Direct request to annotation-list is not implemented.
fr: Les requêtes directes aux annotation-list ne sont pas implémentés.

source: XML Alto is supported natively: just upload the files as media to search inside it.
fr: Le xml alto est désormais supporté : il suffit de télécharger les fichiers pour y chercher du texte.

source: The xml media-type should be a precise one: either "application/alto+xml" or "application/vnd.pdf2xml+xml", not "text/xml" or "application/xml".
fr: Le type de média xml doit être précis, en l’espèce soit « application/alto+xml », soit « application/vnd.pdf2xml+xml », et non « text/xml » ou « application/xml ».

source: New files are automatically managed, but you may need modules Bulk Edit or Easy Admin to fix old ones, if any.
fr: Les nouveaux fichiers sont gérés automatiquement, mais vous pouvez avoir besoin des modules Bulk Edit ou Easy Admin pour corriger les anciens.

source: Badly formatted xml files may be fixed dynamically, but it will affect performance. See %1$sreadme%2$s.
fr: Les xmls mal formatés peuvent être corrigés de manière dynamique, mais cela affectera la performance. Cf. %1$slisez-moi%2$s.

source: A new option allows to include media metadata in search, not only full text.
fr: Une nouvelle option permet d’inclure les métadonnées dans la recherche, pas seulement dans le texte brut.

source: A new option allows to fix bad xml and invalid utf-8 characters.
fr: Une nouvelle option permet de corriger les fichiers xml incorrects ou avec des caractères utf-8 invalides.

source: The module supports the tsv format for quicker search results. See module Extract OCR.
fr: Ce module gère le format tsv pour des recherches plus rapides. Cf. le module Extract OCR.

source: Search within this manifest
fr: Rechercher dans le manifeste

source: Xml parsing error level %1$s, code %2$s, for file "%3$s" (media #%4$s), line %5$s, column %6$s: %7$s
fr: Erreur de décomposition xml de niveau %1$s, code %2$s, pour le fichier « %3$s » (média #%4$s), ligne %5$s, colonne %6$s : %7$s

source: The file "%1$s" (media #%2$s) is not parsable by xml reader neither dom.
fr: Le fichier « %1$s » (media #%2$s) n’est lisible ni par le lecteur xml, ni par le dom.

source: Warning: some files contain invalid unicode characters and cannot be processed directly.
fr: Attention : certains fichiers contiennent des caractères unicode incorrects et ne peuvent pas être traités directement.

source: Warning: some files contain invalid unicode characters and cannot be searched quickly.
fr: Attention : certains fichiers contiennent des caractères unicode incorrects et la recherche ne peut pas y être effectuée rapidement.

source: Incomplete data for xml file from item #%1$s, page %2$s.
fr: Données incomplètes pour le fichier xml du contenu #%1$s, page %2$s.

source: Inconsistent data for xml file from item #%1$s, page %2$s.
fr: Données incohérentes pour le fichier xml du contenu #%1$s, page %2$s.

source: Error: XML alto content may be invalid for item #%1$d, index #%2$d.
fr: Erreur : le contenu xml alto est incorrect pour le contenu #%1$d, index #%2$d.

source: Incomplete data for xml file from pdf media #%1$s, page %2$s.
fr: Données incomplètes pour le fichier xml extrait du média pdf #%1$s, page %2$s.

source: Inconsistent data for xml file from pdf media #%1$s, page %2$s.
fr: Données incohérentes pour le fichier xml extrait du média pdf #%1$s, page %2$s.

source: Inconsistent data for xml file from pdf media #%1$s, page %2$s, row %3$s.
fr: Données incohérentes pour le fichier xml extrait du média pdf #%1$s, page %2$s, ligne %3$s.

source: Error: PDF to XML conversion failed for item #%1$d, media file #%2$d.
fr: Erreur : la conversion pdf en xml a échoué pour le contenu #%1$d, média #%2$d.

source: Error: PDF to TSV conversion failed for item #%1$d, media #%2$d.
fr: Erreur : la conversion pdf en tsv a échoué pour le contenu #%1$d, média #%2$d.

source: Inconsistent data for item #%1$d, tsv media #%2$d, page %3$d, word %4$s.
fr: Données incohérentes pour le contenu #%1$d, média tsv #%2$d, page %3$d, mot %4$s.

source: Warning: Xml format "%1$s" of media #%2$d is not precise. It may be related to a badly formatted file (%3$s). Use EasyAdmin tasks to fix media type.
fr: Attention : le format xml « %1$s » du média #%2$d est imprécis. Cela peut être lié à un fichier mal formaté (%3$s). Utiliser le module Easy Admin pour corriger les types de média.

source: Error: XML content is incorrect for media #%d.
fr: Erreur : le contenu xml est incorrect pour le média #%d.

source: Error: XML content seems empty for media #%d.
fr: Erreur : le contenu xml semble vide pour le média #%d.

source: Error: Cannot get XML content from media #%d.
fr: Erreur : impossible de lire le contenu xml du média #%d.

source: Minimum query length
fr: Longueur minimale de la requête

source: Disable search in media values
fr: Désactiver la recherche dans les valeurs des médias

source: Match images and xmls when they are multiple
fr: Correspondance entre les images et les xmls quand ils sont multiples

source: Media order (page_001.jpg, alto_001.xml, page_002.jpg, alto_002.xml, …)
fr: Ordre des médias (page_001.jpg, alto_001.xml, page_002.jpg, alto_002.xml, …)

source: Media source base filename (page_001.jpg, page_002.jpg, page_002.xml, page_001.xml…)
fr: Noms du fichier source (page_001.jpg, page_002.jpg, page_002.xml, page_001.xml…)

source: Fix bad xml and invalid utf-8 characters
fr: Corriger les xml incorrects et les caractères utf-8 invalides

source: Via DOM (quick)
fr: Via DOM (rapide)

source: Via regex (slow)
fr: Via regex (lent)

source: Missing required keys for object type "%1$s": "%2$s".
fr: Clés manquantes pour le type d’objet « %1$s » : « %2$s ».
